[Killed] BlockStatement
src/calculator.js:3:35
 // src/calculator.js
 const Calculator = {
-    isValid: function(month, day) {
-        if (month < 1 || month > 12) return false;
-        
-        const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-        return day >= 1 && day <= monthDays[month];
-    },
+    isValid: function(month, day) {},
 
     toDays: function(month, day) {
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] ConditionalExpression
src/calculator.js:4:13
 // src/calculator.js
 const Calculator = {
     isValid: function(month, day) {
-        if (month < 1 || month > 12) return false;
+        if (true) return false;
         
         const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] BooleanLiteral
src/calculator.js:4:45
 // src/calculator.js
 const Calculator = {
     isValid: function(month, day) {
-        if (month < 1 || month > 12) return false;
+        if (month < 1 || month > 12) return true;
         
         const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
killedBy: All tests
statusReason: Calculator

    Basic functionality

      ✔ should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] ConditionalExpression
src/calculator.js:7:28
         if (month < 1 || month > 12) return false;
         
         const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-        return day >= 1 && day <= monthDays[month];
+        return day >= 1 && true;
     },
 
killedBy: All tests
statusReason: Calculator

    Basic functionality

      ✔ should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] ConditionalExpression
src/calculator.js:7:16
         if (month < 1 || month > 12) return false;
         
         const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-        return day >= 1 && day <= monthDays[month];
+        return false;
     },
 
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] BlockStatement
src/calculator.js:10:34
         return day >= 1 && day <= monthDays[month];
     },
 
-    toDays: function(month, day) {
-        let days = day;
-        const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-        
-        for (let m = 1; m < month; m++) {
-        days += monthDays[m];
-        }
-        
-        return days;
-    },
+    toDays: function(month, day) {},
 
     calculate: function(month1, day1, month2, day2) {
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] ConditionalExpression
src/calculator.js:14:25
         let days = day;
         const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
         
-        for (let m = 1; m < month; m++) {
+        for (let m = 1; false; m++) {
         days += monthDays[m];
         }
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] EqualityOperator
src/calculator.js:14:25
         let days = day;
         const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
         
-        for (let m = 1; m < month; m++) {
+        for (let m = 1; m <= month; m++) {
         days += monthDays[m];
         }
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] AssignmentOperator
src/calculator.js:15:9
         const monthDays = [0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
         
         for (let m = 1; m < month; m++) {
-        days += monthDays[m];
+        days -= monthDays[m];
         }
         
killedBy: All tests
statusReason: Calculator

    Basic functionality

      ✔ should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] BlockStatement
src/calculator.js:21:53
         return days;
     },
 
-    calculate: function(month1, day1, month2, day2) {
-        if (!this.isValid(month1, day1) || !this.isValid(month2, day2)) {
-        return -1;
-        }
-        
-        const days1 = this.toDays(month1, day1);
-        const days2 = this.toDays(month2, day2);
-        
-        return Math.abs(days2 - days1);
-    },
+    calculate: function(month1, day1, month2, day2) {},
 
     main: function(month1, day1, month2, day2) {
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] BlockStatement
src/calculator.js:22:73
     },
 
     calculate: function(month1, day1, month2, day2) {
-        if (!this.isValid(month1, day1) || !this.isValid(month2, day2)) {
-        return -1;
-        }
+        if (!this.isValid(month1, day1) || !this.isValid(month2, day2)) {}
         
         const days1 = this.toDays(month1, day1);
killedBy: All tests
statusReason: Calculator

    Basic functionality

      ✔ should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] BooleanLiteral
src/calculator.js:22:13
     },
 
     calculate: function(month1, day1, month2, day2) {
-        if (!this.isValid(month1, day1) || !this.isValid(month2, day2)) {
+        if (this.isValid(month1, day1) || !this.isValid(month2, day2)) {
         return -1;
         }
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] UnaryOperator
src/calculator.js:23:16
 
     calculate: function(month1, day1, month2, day2) {
         if (!this.isValid(month1, day1) || !this.isValid(month2, day2)) {
-        return -1;
+        return +1;
         }
         
killedBy: All tests
statusReason: Calculator

    Basic functionality

      ✔ should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] ArithmeticOperator
src/calculator.js:29:25
         const days1 = this.toDays(month1, day1);
         const days2 = this.toDays(month2, day2);
         
-        return Math.abs(days2 - days1);
+        return Math.abs(days2 + days1);
     },
 
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result

[Killed] BlockStatement
src/calculator.js:32:48
         return Math.abs(days2 - days1);
     },
 
-    main: function(month1, day1, month2, day2) {
-        return this.calculate(month1, day1, month2, day2);
-    }
+    main: function(month1, day1, month2, day2) {}
 };
 
killedBy: All tests
statusReason: Calculator

    Basic functionality

      1) should correctly calculate date differences

      ✔ date order should not affect the result
