[Killed] BlockStatement
main.js:5:19
 // But you can uncomment code below and run this file to understand how to use the classes
 
 class MyClass {
-    constructor() {
-        this.students = [];
-    }
+    constructor() {}
 
     addStudent(student) {
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ArrayDeclaration
main.js:6:25
 
 class MyClass {
     constructor() {
-        this.students = [];
+        this.students = ["Stryker was here"];
     }
 
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BlockStatement
main.js:9:25
         this.students = [];
     }
 
-    addStudent(student) {
-        if (!(student instanceof Student)) {
-            return -1;
-        }
-        this.students.push(student);
-        return this.students.length - 1;
-    }
+    addStudent(student) {}
 
     getStudentById(id) {
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent
not ok 1 - Test MyClass's addStudent

[Killed] ConditionalExpression
main.js:10:13
     }
 
     addStudent(student) {
-        if (!(student instanceof Student)) {
+        if (true) {
             return -1;
         }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BooleanLiteral
main.js:10:13
     }
 
     addStudent(student) {
-        if (!(student instanceof Student)) {
+        if (student instanceof Student) {
             return -1;
         }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] UnaryOperator
main.js:11:20
 
     addStudent(student) {
         if (!(student instanceof Student)) {
-            return -1;
+            return +1;
         }
         this.students.push(student);
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent
not ok 1 - Test MyClass's addStudent

[Killed] ArithmeticOperator
main.js:14:16
             return -1;
         }
         this.students.push(student);
-        return this.students.length - 1;
+        return this.students.length + 1;
     }
 
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BlockStatement
main.js:17:24
         return this.students.length - 1;
     }
 
-    getStudentById(id) {
-        if (id < 0 || id >= this.students.length) {
-            return null;
-        }
-        return this.students[id];
-    }
+    getStudentById(id) {}
 }
 
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] EqualityOperator
main.js:18:13
     }
 
     getStudentById(id) {
-        if (id < 0 || id >= this.students.length) {
+        if (id <= 0 || id >= this.students.length) {
             return null;
         }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BlockStatement
main.js:18:51
     }
 
     getStudentById(id) {
-        if (id < 0 || id >= this.students.length) {
-            return null;
-        }
+        if (id < 0 || id >= this.students.length) {}
         return this.students[id];
     }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Survived] BlockStatement
main.js:26:19
 }
 
 class Student {
-    constructor() {
-        this.name = undefined;
-    }
+    constructor() {}
 
     setName(userName) {

[Killed] BlockStatement
main.js:30:23
         this.name = undefined;
     }
 
-    setName(userName) {
-        if (typeof userName !== 'string') {
-            return;
-        }
-        this.name = userName;
-    }
+    setName(userName) {}
 
     getName() {
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
main.js:31:13
     }
 
     setName(userName) {
-        if (typeof userName !== 'string') {
+        if (true) {
             return;
         }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
main.js:31:13
     }
 
     setName(userName) {
-        if (typeof userName !== 'string') {
+        if (false) {
             return;
         }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BlockStatement
main.js:37:15
         this.name = userName;
     }
 
-    getName() {
-        if (this.name === undefined) {
-            return '';
-        }
-        return this.name;
-    }
+    getName() {}
 }
 
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
main.js:38:13
     }
 
     getName() {
-        if (this.name === undefined) {
+        if (this.name !== undefined) {
             return '';
         }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BlockStatement
main.js:38:38
     }
 
     getName() {
-        if (this.name === undefined) {
-            return '';
-        }
+        if (this.name === undefined) {}
         return this.name;
     }
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] ObjectLiteral
main.js:55:18
 //     console.log('[+] Added student with id: %d, name: %s', newStudentId, newStudentName);
 // });
 
-module.exports = { MyClass, Student };
+module.exports = {};
killedBy: All tests
statusReason: > lab1@1.0.0 test
> node --test main_test.js


TAP version 13

# Subtest: Test MyClass's addStudent
